[
  {
    "id": "1",
    "name": "Wells Fargo",
    "logo": "/img/Wells_Fargo_Logo_(2020).svg.png",
    "category": "Bank",
    "averageScore": 4.1,
    "description": {
      "en": "One of the largest financial services firms in the U.S., providing retail banking, mortgages, credit cards, business banking, wealth management, and investment services.",
      "th": "หนึ่งในสถาบันการเงินที่ใหญ่ที่สุดในสหรัฐฯ ให้บริการธนาคารค้าปลีก สินเชื่อที่อยู่อาศัย บัตรเครดิต ธนาคารธุรกิจ การจัดการความมั่งคั่ง และบริการการลงทุน"
    },
    "website": "https://www.wellsfargo.com",
    "reviewCount": 452
  },
  {
    "id": "2",
    "name": "Goldman Sachs",
    "logo": "/img/Goldman_Sachs.svg.png",
    "category": "Broker",
    "averageScore": 4.6,
    "description": {
      "en": "A leading global investment bank providing investment banking, asset management, private equity, financial advisory services, and consumer banking through Marcus platform.",
      "th": "ธนาคารเพื่อการลงทุนชั้นนำระดับโลก ให้บริการธนาคารเพื่อการลงทุน การจัดการสินทรัพย์ ไพรเวทอิควิตี้ บริการที่ปรึกษาทางการเงิน และธนาคารค้าปลีกผ่าน Marcus"
    },
    "website": "https://www.goldmansachs.com",
    "reviewCount": 387
  },
  {
    "id": "3",
    "name": "U.S. Bancorp",
    "logo": "/img/us-bancorp--600.png",
    "category": "Bank",
    "averageScore": 4.3,
    "description": {
      "en": "The fifth-largest banking institution in the United States, offering personal banking, small business banking, wealth management, treasury management, and commercial lending.",
      "th": "สถาบันธนาคารที่ใหญ่เป็นอันดับห้าในสหรัฐอเมริกา ให้บริการธนาคารส่วนบุคคล ธนาคารธุรกิจขนาดเล็ก การจัดการความมั่งคั่ง การจัดการเงินคลัง และสินเชื่อเชิงพาณิชย์"
    },
    "website": "https://www.usbank.com",
    "reviewCount": 398
  },
  {
    "id": "4",
    "name": "JPMorgan Chase",
    "logo": "/img/jp-morgan-4.webp",
    "category": "Bank",
    "averageScore": 4.5,
    "description": {
      "en": "The largest bank in the United States, offering comprehensive financial services including retail banking, investment banking, asset management, and private banking solutions.",
      "th": "ธนาคารที่ใหญ่ที่สุดในสหรัฐอเมริกา ให้บริการทางการเงินที่ครอบคลุม รวมถึงธนาคารค้าปลีก ธนาคารเพื่อการลงทุน การจัดการสินทรัพย์ และบริการธนาคารส่วนตัว"
    },
    "website": "https://www.jpmorganchase.com",
    "reviewCount": 521
  },
  {
    "id": "5",
    "name": "Bank of America",
    "logo": "/img/new-bank-of-america-logo.jpg",
    "category": "Bank",
    "averageScore": 4.2,
    "description": {
      "en": "A multinational investment bank and financial services company providing consumer banking, wealth management, investment banking, and global markets services.",
      "th": "ธนาคารเพื่อการลงทุนข้ามชาติและบริษัทบริการทางการเงิน ให้บริการธนาคารค้าปลีก การจัดการความมั่งคั่ง ธนาคารเพื่อการลงทุน และบริการตลาดโลก"
    },
    "website": "https://www.bankofamerica.com",
    "reviewCount": 489
  },
  {
    "id": "6",
    "name": "Morgan Stanley",
    "logo": "/img/Morgan-Stanley-Logo.jpg",
    "category": "Broker",
    "averageScore": 4.5,
    "description": {
      "en": "A leading global financial services firm specializing in investment banking, securities trading, wealth management, and investment management for institutions and individuals.",
      "th": "บริษัทบริการทางการเงินชั้นนำระดับโลก เชี่ยวชาญด้านธนาคารเพื่อการลงทุน การซื้อขายหลักทรัพย์ การจัดการความมั่งคั่ง และการจัดการการลงทุนสำหรับสถาบันและบุคคล"
    },
    "website": "https://www.morganstanley.com",
    "reviewCount": 356
  },
  {
    "id": "7",
    "name": "Charles Schwab",
    "logo": "/img/Charles_Schwab_Corporation_logo.svg.png",
    "category": "Broker",
    "averageScore": 4.7,
    "description": {
      "en": "A leading brokerage and banking company offering investment services, retirement planning, wealth management, and innovative trading platforms for retail and institutional clients.",
      "th": "บริษัทโบรกเกอร์และธนาคารชั้นนำ ให้บริการลงทุน การวางแผนเกษียณ การจัดการความมั่งคั่ง และแพลตฟอร์มการซื้อขายที่ทันสมัยสำหรับลูกค้ารายย่อยและสถาบัน"
    },
    "website": "https://www.schwab.com",
    "reviewCount": 423
  },
  {
    "id": "8",
    "name": "American Express",
    "logo": "/img/American_Express_logo_(2018).svg.png",
    "category": "Payment",
    "averageScore": 4.4,
    "description": {
      "en": "A globally integrated payments company providing credit cards, charge cards, travel services, and merchant payment solutions with premium rewards and benefits.",
      "th": "บริษัทการชำระเงินแบบบูรณาการระดับโลก ให้บริการบัตรเครดิต บัตรชาร์จ บริการท่องเที่ยว และโซลูชันการชำระเงินสำหรับผู้ค้าพร้อมรางวัลและสิทธิพิเศษระดับพรีเมียม"
    },
    "website": "https://www.americanexpress.com",
    "reviewCount": 512
  },
  {
    "id": "9",
    "name": "Citigroup",
    "logo": "/img/citigroup--600.png",
    "category": "Bank",
    "averageScore": 4.0,
    "description": {
      "en": "A global banking giant offering consumer banking, corporate banking, investment banking, and wealth management services across 160 countries worldwide.",
      "th": "ธนาคารยักษ์ใหญ่ระดับโลก ให้บริการธนาคารค้าปลีก ธนาคารองค์กร ธนาคารเพื่อการลงทุน และบริการจัดการความมั่งคั่งใน 160 ประเทศทั่วโลก"
    },
    "website": "https://www.citigroup.com",
    "reviewCount": 445
  },
  {
    "id": "10",
    "name": "BlackRock",
    "logo": "/img/blackrock_logo.png",
    "category": "Fintech",
    "averageScore": 4.6,
    "description": {
      "en": "The world's largest asset management firm, providing investment management, risk management, and advisory services for institutional and retail clients globally.",
      "th": "บริษัทจัดการสินทรัพย์ที่ใหญ่ที่สุดในโลก ให้บริการจัดการการลงทุน การจัดการความเสี่ยง และบริการที่ปรึกษาสำหรับลูกค้าสถาบันและรายย่อยทั่วโลก"
    },
    "website": "https://www.blackrock.com",
    "reviewCount": 378
  },
  {
    "id": "11",
    "name": "Fidelity Investments",
    "logo": "/img/Fidelity-Investments-Logo-Vector-01-scaled.jpeg",
    "category": "Fintech",
    "averageScore": 4.5,
    "description": {
      "en": "A multinational financial services corporation offering brokerage services, mutual funds, retirement planning, wealth management, and investment advisory solutions.",
      "th": "บริษัทบริการทางการเงินข้ามชาติ ให้บริการโบรกเกอร์ กองทุนรวม การวางแผนเกษียณ การจัดการความมั่งคั่ง และบริการที่ปรึกษาการลงทุน"
    },
    "website": "https://www.fidelity.com",
    "reviewCount": 467
  },
  {
    "id": "12",
    "name": "State Street Corporation",
    "logo": "/img/State_street.png",
    "category": "Fintech",
    "averageScore": 4.3,
    "description": {
      "en": "A leading financial services and asset management company specializing in custody services, investment management, and investment research for institutional investors.",
      "th": "บริษัทบริการทางการเงินและการจัดการสินทรัพย์ชั้นนำ เชี่ยวชาญด้านบริการรักษาทรัพย์สิน การจัดการการลงทุน และการวิจัยการลงทุนสำหรับนักลงทุนสถาบัน"
    },
    "website": "https://www.statestreet.com",
    "reviewCount": 289
  },
  {
    "id": "13",
    "name": "Capital One",
    "logo": "/img/capital_one.png",
    "category": "Bank",
    "averageScore": 4.2,
    "description": {
      "en": "A diversified banking company specializing in credit cards, auto loans, banking, and savings accounts with innovative digital banking solutions and customer-centric approach.",
      "th": "บริษัทธนาคารที่หลากหลาย เชี่ยวชาญด้านบัตรเครดิต สินเชื่อรถยนต์ บัญชีธนาคารและเงินฝากออมทรัพย์ พร้อมโซลูชันธนาคารดิจิทัลที่ทันสมัยและเน้นลูกค้าเป็นศูนย์กลาง"
    },
    "website": "https://www.capitalone.com",
    "reviewCount": 534
  },
  {
    "id": "14",
    "name": "PNC Financial Services",
    "logo": "/img/pnc-bank-logo-0.png",
    "category": "Bank",
    "averageScore": 4.1,
    "description": {
      "en": "A diversified financial services institution offering retail banking, corporate banking, asset management, and residential mortgage banking across the United States.",
      "th": "สถาบันการเงินที่หลากหลาย ให้บริการธนาคารค้าปลีก ธนาคารองค์กร การจัดการสินทรัพย์ และธนาคารสินเชื่อที่อยู่อาศัยทั่วสหรัฐอเมริกา"
    },
    "website": "https://www.pnc.com",
    "reviewCount": 367
  },
  {
    "id": "15",
    "name": "TD Bank",
    "logo": "/img/Toronto-Dominion_Bank_logo.svg.png",
    "category": "Bank",
    "averageScore": 4.3,
    "description": {
      "en": "A leading North American bank providing personal and commercial banking, wealth management, and business banking services with exceptional customer service and convenient hours.",
      "th": "ธนาคารชั้นนำในอเมริกาเหนือ ให้บริการธนาคารส่วนบุคคลและเชิงพาณิชย์ การจัดการความมั่งคั่ง และบริการธนาคารธุรกิจพร้อมบริการลูกค้าชั้นเยี่ยมและเวลาทำการที่สะดวก"
    },
    "website": "https://www.td.com",
    "reviewCount": 412
  },
  {
    "id": "16",
    "name": "SCB (Siam Commercial Bank)",
    "logo": "/img/scb.jpg",
    "category": "Bank",
    "averageScore": 4.3,
    "description": {
      "en": "Siam Commercial Bank Public Company Limited, a leading Thai bank providing comprehensive financial services.",
      "th": "ธนาคารไทยพาณิชย์ จำกัด (มหาชน) ธนาคารชั้นนำของไทยที่ให้บริการทางการเงินครบวงจร"
    },
    "website": "https://www.scb.co.th",
    "reviewCount": 342
  },
  {
    "id": "17",
    "name": "KBANK (Kasikornbank)",
    "logo": "/img/kbank_logo.jpg",
    "category": "Bank",
    "averageScore": 4.4,
    "description": {
      "en": "Kasikornbank Public Company Limited, leader in financial innovation and digital banking services.",
      "th": "ธนาคารกสิกรไทย จำกัด (มหาชน) ผู้นำด้านนวัตกรรมการเงินและบริการธนาคารดิจิทัล"
    },
    "website": "https://www.kasikornbank.com",
    "reviewCount": 398
  },
  {
    "id": "18",
    "name": "BBL (Bangkok Bank)",
    "logo": "/img/BBL-New-EN.jpg",
    "category": "Bank",
    "averageScore": 4.2,
    "description": {
      "en": "Bangkok Bank Public Company Limited, the largest commercial bank in Thailand.",
      "th": "ธนาคารกรุงเทพ จำกัด (มหาชน) ธนาคารพาณิชย์ที่ใหญ่ที่สุดในประเทศไทย"
    },
    "website": "https://www.bangkokbank.com",
    "reviewCount": 425
  },
  {
    "id": "19",
    "name": "KTB (Krung Thai Bank)",
    "logo": "/img/ktb.png",
    "category": "Bank",
    "averageScore": 3.9,
    "description": {
      "en": "Krung Thai Bank Public Company Limited, a state-owned commercial bank serving nationwide.",
      "th": "ธนาคารกรุงไทย จำกัด (มหาชน) ธนาคารพาณิชย์ของรัฐที่ให้บริการทั่วประเทศ"
    },
    "website": "https://www.ktb.co.th",
    "reviewCount": 287
  },
  {
    "id": "20",
    "name": "BAY (Bank of Ayudhya)",
    "logo": "/img/bank_of_ayudhya.jpg",
    "category": "Bank",
    "averageScore": 4.1,
    "description": {
      "en": "Bank of Ayudhya Public Company Limited (Krungsri), a leading commercial bank under MUFG Group.",
      "th": "ธนาคารกรุงศรีอยุธยา จำกัด (มหาชน) ธนาคารพาณิชย์ชั้นนำในเครือ MUFG"
    },
    "website": "https://www.krungsri.com",
    "reviewCount": 315
  },
  {
    "id": "21",
    "name": "TTB (TMBThanachart Bank)",
    "logo": "/img/ttb_primary-logo-RGB-01.png",
    "category": "Bank",
    "averageScore": 3.8,
    "description": {
      "en": "TMBThanachart Bank Public Company Limited, formed from the merger of TMB and Thanachart banks.",
      "th": "ธนาคารทหารไทยธนชาต จำกัด (มหาชน) ธนาคารที่เกิดจากการควรรวมกิจการ TMB และ ธนชาต"
    },
    "website": "https://www.ttbbank.com",
    "reviewCount": 234
  },
  {
    "id": "22",
    "name": "TISCO (Tisco Financial Group)",
    "logo": "/img/Tisco_logo.png",
    "category": "Fintech",
    "averageScore": 4.5,
    "description": {
      "en": "TISCO Financial Group Public Company Limited, providing comprehensive financial services including banking, securities, and life insurance.",
      "th": "บริษัท ทิสโก้ไฟแนนเชียลกรุ๊ป จำกัด (มหาชน) ผู้ให้บริการทางการเงินครบวงจร ธนาคาร หลักทรัพย์ และประกันชีวิต"
    },
    "website": "https://www.tisco.co.th",
    "reviewCount": 189
  },
  {
    "id": "23",
    "name": "TIDLOR (Tidlor Capital)",
    "logo": "/img/TIDLOR_2024-08-09.jpg",
    "category": "Fintech",
    "averageScore": 4.0,
    "description": {
      "en": "Tidlor Capital Public Company Limited, providing personal loans and auto financing services.",
      "th": "บริษัท ทิดลอร์ แคปปิตอล จำกัด (มหาชน) ผู้ให้บริการสินเชื่อส่วนบุคคลและสินเชื่อรถยนต์"
    },
    "website": "https://www.tidlor.com",
    "reviewCount": 156
  },
  {
    "id": "24",
    "name": "SAWAD (Srisawad Corporation)",
    "logo": "/img/srisawad--600.png",
    "category": "Fintech",
    "averageScore": 3.7,
    "description": {
      "en": "Srisawad Corporation Public Company Limited, providing credit services for SME entrepreneurs.",
      "th": "บริษัท ศรีสวัสดิ์ คอร์ปอเรชั่น จำกัด (มหาชน) ผู้ให้บริการสินเชื่อเพื่อผู้ประกอบการ SME"
    },
    "website": "https://www.srisawadpower.com",
    "reviewCount": 142
  },
  {
    "id": "25",
    "name": "MTC (Muangthai Capital)",
    "logo": "/img/mtc.png",
    "category": "Fintech",
    "averageScore": 3.9,
    "description": {
      "en": "Muangthai Capital Public Company Limited, providing motorcycle financing and microfinance services.",
      "th": "บริษัท เมืองไทย แคปปิตอล จำกัด (มหาชน) ผู้ให้บริการสินเชื่อรถจักรยานยนต์และไมโครไฟแนนซ์"
    },
    "website": "https://www.muangthaigroup.com",
    "reviewCount": 178
  },
  {
    "id": "26",
    "name": "KTC (Krungthai Card)",
    "logo": "/img/krungthai-card--600.png",
    "category": "Payment",
    "averageScore": 4.2,
    "description": {
      "en": "Krungthai Card Public Company Limited, providing credit card and personal loan services.",
      "th": "บริษัท บัตรกรุงไทย จำกัด (มหาชน) ผู้ให้บริการบัตรเครดิตและสินเชื่อส่วนบุคคล"
    },
    "website": "https://www.ktc.co.th",
    "reviewCount": 267
  },
  {
    "id": "27",
    "name": "AEONTS (AEON Thana Sinsap)",
    "logo": "/img/AEONTS.webp",
    "category": "Payment",
    "averageScore": 4.0,
    "description": {
      "en": "AEON Thana Sinsap (Thailand) Public Company Limited, providing credit card and personal loan services.",
      "th": "บริษัท อิออน ธนสินทรัพย์ (ไทยแลนด์) จำกัด (มหาชน) ผู้ให้บริการบัตรเครดิตและสินเชื่อส่วนบุคคล"
    },
    "website": "https://www.aeon.co.th",
    "reviewCount": 201
  },
  {
    "id": "28",
    "name": "TCAP (Thanachart Capital)",
    "logo": "/img/thanachart-capital--600.png",
    "category": "Fintech",
    "averageScore": 3.8,
    "description": {
      "en": "Thanachart Capital Public Company Limited, a financial holding company covering insurance and securities businesses.",
      "th": "บริษัท ธนชาต แคปปิตอล จำกัด (มหาชน) บริษัทโฮลดิ้งด้านการเงิน ครอบคลุมธุรกิจประกันภัยและหลักทรัพย์"
    },
    "website": "https://www.thanachartvital.co.th",
    "reviewCount": 165
  },
  {
    "id": "29",
    "name": "SCBX (SCB X)",
    "logo": "/img/scbx-logo.jpg",
    "category": "Fintech",
    "averageScore": 4.6,
    "description": {
      "en": "SCB X Public Company Limited, a financial technology and innovation holding company.",
      "th": "บริษัท เอสซีบี เอ็กซ์ จำกัด (มหาชน) บริษัทโฮลดิ้งด้านเทคโนโลยีการเงินและนวัตกรรม"
    },
    "website": "https://www.scbx.com",
    "reviewCount": 223
  },
  {
    "id": "30",
    "name": "KFLT (Kasikorn Leasing)",
    "logo": "/img/kasikornleasing_logo.jfif",
    "category": "Fintech",
    "averageScore": 3.9,
    "description": {
      "en": "Kiat NM Asset Management Public Company Limited, providing hire-purchase financing and asset management services.",
      "th": "บริษัท เกียรติ เอ็น เอ็ม แอสเสท แมเนจเมนท์ จำกัด (มหาชน) ผู้ให้บริการสินเชื่อเช่าซื้อและบริหารสินทรัพย์"
    },
    "website": "https://www.kfltasset.com",
    "reviewCount": 128
  },
  {
    "id": "31",
    "name": "CIMBT (CIMB Thai Bank)",
    "logo": "/img/cimb-thai-bank-public-company-limited--600.png",
    "category": "Bank",
    "averageScore": 3.7,
    "description": {
      "en": "CIMB Thai Bank Public Company Limited, a commercial bank under CIMB Group.",
      "th": "ธนาคารซีไอเอ็มบี ไทย จำกัด (มหาชน) ธนาคารพาณิชย์ในเครือ CIMB Group"
    },
    "website": "https://www.cimbthai.com",
    "reviewCount": 145
  },
  {
    "id": "32",
    "name": "LHFG (Land and Houses Financial Group)",
    "logo": "/img/LHFG.jpeg",
    "category": "Fintech",
    "averageScore": 4.1,
    "description": {
      "en": "Land and Houses Financial Group Public Company Limited, a comprehensive financial services group.",
      "th": "บริษัท แลนด์ แอนด์ เฮ้าส์ ไฟแนนเชียล กรุ๊ป จำกัด (มหาชน) กลุ่มธุรกิจทางการเงินครบวงจร"
    },
    "website": "https://www.lhfg.co.th",
    "reviewCount": 134
  },
  {
    "id": "33",
    "name": "UOBKH (United Overseas Bank)",
    "logo": "/img/UOB_LOGO_800x800.png",
    "category": "Bank",
    "averageScore": 4.0,
    "description": {
      "en": "United Overseas Bank (Thai) Public Company Limited, a commercial bank under UOB Group from Singapore.",
      "th": "ธนาคารยูโอบี จำกัด (มหาชน) ธนาคารพาณิชย์ในเครือ UOB Group จากสิงคโปร์"
    },
    "website": "https://www.uob.co.th",
    "reviewCount": 167
  },
  {
    "id": "34",
    "name": "ASP (Asia Plus Securities)",
    "logo": "/img/ASP.png",
    "category": "Broker",
    "averageScore": 4.3,
    "description": {
      "en": "Asia Plus Securities Public Company Limited, providing securities trading and investment services.",
      "th": "บริษัทหลักทรัพย์ เอเซีย พลัส จำกัด (มหาชน) ผู้ให้บริการซื้อขายหลักทรัพย์และการลงทุน"
    },
    "website": "https://www.asiaplus.co.th",
    "reviewCount": 156
  }
]
